danngreen/stm32mp1-baremetal/examples/usb_msc_device/usbd_conf.c
/*
3. Set up the Data FIFO RAM for each of the FIFOs –
	Program the OTG_GRXFSIZ register, to be able to receive control OUT data and setup data.
	If thresholding is not enabled, at a minimum, this must be equal to
	1 max packet size of control endpoint 0 +
	2 Words (for the status of the control OUT data packet) +
	10 Words (for setup packets). –
	Program the OTG_DIEPTXF0 register (depending on the FIFO number chosen)
	to be able to transmit control IN data.
	At a minimum, this must be equal to 1 max packet size of control endpoint 0.

*/
	uint_fast16_t maxoutpacketsize4 = size2buff4(USB_OTG_MAX_EP0_SIZE);

	// добавление шести обеспечивает работу конфигурации с единственным устройством HID
	maxoutpacketsize4 += 6;

	//uint_fast16_t base4;
	uint_fast8_t numcontrolendpoints = 1;
	uint_fast8_t numoutendpoints = 1;

	// при addplaces = 3 появился звук на передаче в трансивер (при 2-х компортах)
	// но если CDC и UAC включать поодиночке, обмен не нарушается и при 0.
	// todo: найти все-таки документ https://www.synopsys.com/ip_prototyping_kit_usb3otgv2_drd_pc.pdf
	// еще интересен QL-Hi-Speed-USB-2.0-OTG-Controller-Data-Sheet.pdf

	uint_fast8_t addplaces = 3;

	const uint_fast16_t full4 = fullsize / 4;
	uint_fast16_t last4 = full4;
	uint_fast16_t base4 = 0;

	{
		const uint_fast8_t pipe = USBD_EP_MSC_IN & 0x7F;
		USBx->DIEPTXF[pipe - 1] = usbd_makeTXFSIZ(0x240, 0x100);
	}

	//PRINTF(PSTR("usbd_fifo_initialize9: 4*(full4-last4)=%u\n"), 4 * (full4 - last4));

	/* control endpoint TX FIFO */
	{
		/* Установить размер TX FIFO EP0 */
		const uint_fast16_t size4 = 2 * (size2buff4(USB_OTG_MAX_EP0_SIZE) + add3tx);
		ASSERT(last4 >= size4);
		last4 -= size4;
		USBx->DIEPTXF0_HNPTXFSIZ = usbd_makeTXFSIZ(last4, size4);
		//PRINTF(PSTR("usbd_fifo_initialize10 TX FIFO %u bytes: 4*(full4-last4)=%u\n"), 4 * size4, 4 * (full4 - last4));
	}
	/* control endpoint RX FIFO */
	{
		/* Установить размер RX FIFO -  теперь все что осталоь - используем last4 вместо size4 */
		// (4 * number of control endpoints + 6) +
		// ((largest USB packet used / 4) + 1 for status information) +
		// (2 * number of OUT endpoints) +
		// 1 for Global NAK
		const uint_fast16_t size4 =
				(4 * numcontrolendpoints + 6) +
				(maxoutpacketsize4 + 1) +
				(2 * numoutendpoints) +
				1 +
				addplaces;

		//PRINTF(PSTR("usbd_fifo_initialize11 RX FIFO %u bytes: 4*(full4-last4)=%u bytes (last4=%u, size4=%u)\n"), 4 * size4, 4 * (full4 - last4), last4, size4);
		ASSERT(last4 >= size4);
		USBx->GRXFSIZ = (USBx->GRXFSIZ & ~ USB_OTG_GRXFSIZ_RXFD) |
			(last4 << USB_OTG_GRXFSIZ_RXFD_Pos) |	// was: size4 - то что осталось
			0;
		base4 += size4;
	}

	if (base4 > last4 || last4 > full4)
	{
		char b [64];
		printstr("usbd_fifo_initialize error\n\r");
		//PRINTF(PSTR("usbd_fifo_initialize error: base4=%u, last4=%u, fullsize=%u\n"), (base4 * 4), (last4 * 4), fullsize);
//		local_snprintf_P(b, sizeof b / sizeof b [0], PSTR("used=%u"), (base4 * 4) + (fullsize - last4 * 4));
//		colmain_setcolors(COLORMAIN_RED, BGCOLOR);
//		display_at(0, 0, b);
		for (;;)
			;
	}
	else
	{
		//PRINTF(PSTR("usbd_fifo_initialize: base4=%u, last4=%u, fullsize=%u\n"), (base4 * 4), (last4 * 4), fullsize);
	}

	(void) USB_FlushRxFifo(USBx);
	(void) USB_FlushTxFifo(USBx, 0x10U); /* all Tx FIFOs */
}




static uint_fast8_t hardware_usbd_get_vbusnow0(void)
{
	return 0;
}

/*******************************************************************************
                       LL Driver Interface (USB Device Library --> PCD)
*******************************************************************************/

/**
  * @brief  Initializes the low level portion of the device driver.
  * @param  pdev: Device handle
  * @retval USBD status
  */
USBD_StatusTypeDef USBD_LL_Init(USBD_HandleTypeDef *pdev)
{
	/* Link The driver to the stack */
	//	hpcd->pData = pdev;
	//	pdev->pData = hpcd;
	/* Init USB Ip. */
	hpcd_USB_OTG.Instance = USB_OTG_HS;

	/* Link the driver to the stack. */
	hpcd_USB_OTG.pData = pdev;
	pdev->pData = & hpcd_USB_OTG;
	hpcd_USB_OTG.Init.dev_endpoints = 9;	// STM32MP1/STM32H7: 1 i/o, 8 in, 8 out
	hpcd_USB_OTG.Init.speed = PCD_SPEED_HIGH;
	hpcd_USB_OTG.Init.dma_enable = DISABLE;
	hpcd_USB_OTG.Init.phy_itface = USB_OTG_HS_EMBEDDED_PHY;
	hpcd_USB_OTG.Init.Sof_enable = DISABLE;
	hpcd_USB_OTG.Init.low_power_enable = DISABLE;
	hpcd_USB_OTG.Init.lpm_enable = DISABLE;
	hpcd_USB_OTG.Init.vbus_sensing_enable = DISABLE;
	hpcd_USB_OTG.Init.use_dedicated_ep1 = DISABLE;
	hpcd_USB_OTG.Init.use_external_vbus = DISABLE;

	if (HAL_PCD_Init( & hpcd_USB_OTG) != HAL_OK)
	{
		Error_Handler();
	}

#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
	/* Register USB PCD CallBacks */
	HAL_PCD_RegisterCallback(& hpcd_USB_OTG, HAL_PCD_SOF_CB_ID, PCD_SOFCallback);
	HAL_PCD_RegisterCallback(& hpcd_USB_OTG, HAL_PCD_SETUPSTAGE_CB_ID, PCD_SetupStageCallback);
	HAL_PCD_RegisterCallback(& hpcd_USB_OTG, HAL_PCD_RESET_CB_ID, PCD_ResetCallback);
	HAL_PCD_RegisterCallback(& hpcd_USB_OTG, HAL_PCD_SUSPEND_CB_ID, PCD_SuspendCallback);
	HAL_PCD_RegisterCallback(& hpcd_USB_OTG, HAL_PCD_RESUME_CB_ID, PCD_ResumeCallback);
	HAL_PCD_RegisterCallback(& hpcd_USB_OTG, HAL_PCD_CONNECT_CB_ID, PCD_ConnectCallback);
	HAL_PCD_RegisterCallback(& hpcd_USB_OTG, HAL_PCD_DISCONNECT_CB_ID, PCD_DisconnectCallback);

	HAL_PCD_RegisterDataOutStageCallback(& hpcd_USB_OTG, PCD_DataOutStageCallback);
	HAL_PCD_RegisterDataInStageCallback(& hpcd_USB_OTG, PCD_DataInStageCallback);
	HAL_PCD_RegisterIsoOutIncpltCallback(& hpcd_USB_OTG, PCD_ISOOUTIncompleteCallback);
	HAL_PCD_RegisterIsoInIncpltCallback(& hpcd_USB_OTG, PCD_ISOINIncompleteCallback);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

	if (USB_Is_OTG_HS(hpcd_USB_OTG.Instance))
	{
		// У OTH_HS размер FIFO 4096 байт
		usbd_fifo_initialize( & hpcd_USB_OTG, 4096, 1, hpcd_USB_OTG.Init.dma_enable);
	}
	else
	{
		// У OTH_FS размер FIFO 1280 байт
		usbd_fifo_initialize( & hpcd_USB_OTG, 1280, 0, hpcd_USB_OTG.Init.dma_enable);
	}
	return USBD_OK;
}

/**
  * @brief  De-Initializes the low level portion of the device driver.
  * @param  pdev: Device handle
  * @retval USBD status
  */
USBD_StatusTypeDef USBD_LL_DeInit(USBD_HandleTypeDef *pdev)
{
  HAL_StatusTypeDef hal_status = HAL_OK;
  USBD_StatusTypeDef usb_status = USBD_OK;

